[
  {
    "date": "2026-02-16",
    "title": "Fix del panel de ruteo masivo: importador flexible + schema/RLS normalizado",
    "highlights": [
      "Se alineó route_stops al schema real (delivery_id/address/phone) para ruteo masivo estable.",
      "Se corrigió ruteo masivo agregando carrier por defecto/inferido para shipments.",
      "Se alineó el importador al schema real de shipments (address_line/recipient_*).",
      "Se corrigió accesibilidad del diálogo y se estabilizó carga por CSV (XLSX con fallback).",
      "Se corrigió carga de zonas (evita 400 por keywords) y se habilitó lectura de XLSX (con fallback a CSV).",
      "Se corrigió el importador CSV/XLSX de /admin/routes con mapeo tolerante de encabezados (order_id, cliente, teléfono, dirección, ciudad, CP y zona) para evitar casos de '0 pedidos válidos' cuando sí hay filas.",
      "El preview ahora muestra conteo de filas válidas/inválidas, primeras 20 filas y errores por registro (por ejemplo falta dirección o datos mínimos).",
      "La creación masiva de rutas quedó estable en modo driver único y driver por zona, con segmentación automática en chunks de 150 pedidos por ruta.",
      "Se normalizó route_stops para insertar datos mínimos de operación (position, title, address_text y meta) manteniendo compatibilidad con stop_order/address/status.",
      "Se añadieron fixes de esquema para zones.color (default #6B7280) y route_stops.title (default ''), además de RLS admin FOR ALL en routes y route_stops con is_admin().",
      "La vista del driver ahora muestra título de parada con fallback robusto: title || recipient_name || address_line1 || 'Parada'."
    ]
  },
  {
    "date": "2026-02-15",
    "title": "Ruteo masivo por Excel/CSV con segmentación por zonas y drivers",
    "highlights": [
      "Admin /admin/routes ahora permite subir pedidos por archivo (CSV y XLSX cuando la librería está disponible), previsualizar filas y validar dirección obligatoria.",
      "Se agregó asignación automática de zona por keywords/CP y generación de rutas por zona en bloques de hasta 150 pedidos por ruta, con selección de driver único o por zona.",
      "El alta masiva crea shipments, routes y route_stops en cadena y muestra resumen humano de rutas creadas y conteos por zona.",
      "Se reforzó el modelo/RLS en Supabase para shipments, routes y route_stops; drivers solo leen su operación y admin mantiene CRUD completo.",
      "Admin /admin/zones ahora permite editar keywords tipo chips para mejorar la clasificación automática de direcciones.",
      "Driver /app muestra paradas de la ruta de hoy desde route_stops + shipments con estados vacíos claros."
    ]
  },
  {
    "date": "2026-02-14",
    "title": "Fix RLS en rutas: admin crea sin 42501 y driver ve solo lo suyo",
    "highlights": [
      "Se ajustaron políticas RLS en public.routes y public.route_stops para que usuarios admin autenticados tengan FOR ALL (crear/editar/eliminar) usando public.is_admin().",
      "Se definieron políticas de lectura para drivers autenticados que solo permiten ver rutas con driver_profile_id = auth.uid() y sus paradas asociadas vía EXISTS sobre routes.",
      "Se retiró la variante de políticas 'today' para evitar bloqueos inesperados y alinear el acceso con la asignación real por driver.",
      "Con esto, /admin/routes puede crear rutas sin error 42501 y la app del driver mantiene visibilidad restringida a sus propios datos."
    ]
  },
  {
    "date": "2026-02-13",
    "title": "Fix de alineación routes: driver_profile_id real en admin",
    "highlights": [
      "Se agregó una migración de compatibilidad para asegurar public.routes.driver_profile_id con foreign key a public.profiles(id) e índice compuesto (driver_profile_id, route_date).",
      "Si la base tenía columnas legacy (driver_id o driver_user_id), ahora se migran automáticamente a driver_profile_id sin perder asignaciones existentes.",
      "Los queries del frontend para rutas quedaron estandarizados a nombres reales del schema (driver_profile_id en routes y route_id/stop_order en route_stops).",
      "Con este ajuste, /admin/routes y la vista del driver consultan el mismo contrato de datos en Supabase."
    ]
  },
  {
    "date": "2026-02-12",
    "title": "Asignación mínima de rutas admin→driver en producción",
    "highlights": [
      "Se estandarizó el esquema de public.routes y public.route_stops (driver_profile_id, route_date, title/address/lat/lng/status) con índices para consulta por driver y orden de paradas.",
      "Se reforzó RLS para que admin tenga CRUD completo en rutas/paradas y driver solo pueda leer su ruta de hoy y sus stops asociados.",
      "Admin /admin/routes ahora permite seleccionar driver, crear ruta de hoy, gestionar paradas (agregar, reordenar, borrar) y guardar cambios con toasts de éxito/error.",
      "Driver /app carga la ruta de hoy con la nueva estructura y muestra estado vacío limpio cuando no tiene ruta asignada."
    ]
  },
  {
    "date": "2026-02-12",
    "title": "Fix de cambio de rol en Admin Usuarios (RPC segura)",
    "highlights": [
      "Se reemplazó el cambio de rol directo por una función SQL SECURITY DEFINER (admin_set_user_role) que valida sesión, rol admin y roles permitidos (admin, driver, ops).",
      "El endpoint /api/admin/set-role ahora usa el token Bearer del usuario logueado y ejecuta supabase.rpc con ANON KEY, sin usar service_role para modificar profiles.role.",
      "Admin /users mantiene Authorization al cambiar rol, refresca la lista después del update y muestra toasts más claros con éxito o causa real del error.",
      "Se endurecieron mensajes de error para distinguir sesión expirada, permisos insuficientes, rol inválido y usuario objetivo inexistente."
    ]
  },
  {
    "date": "2026-02-12",
    "title": "Bloque 2 reconstruido: Data Layer real con Supabase",
    "highlights": [
      "Se añadieron migraciones para zones, shipments, deliveries y shipment_events con índices y timestamps para operación real.",
      "Se activó RLS usando public.is_admin() y permisos acotados para drivers en envíos, entregas y eventos.",
      "Los servicios de zonas, usuarios, paquetes, issues y tareas ahora consultan Supabase con un único wrapper getSupabaseClient.",
      "Admin Zonas, Admin Mapa y Admin Deliveries/[id] consumen datos reales y muestran estados vacíos claros cuando no hay registros.",
      "Se agregó seed opcional de desarrollo con 1 admin, 1 driver, 1 ruta con stops y datos demo de zonas/envíos/entregas."
    ]
  },
  {
    "date": "2026-02-05",
    "title": "Bloque 4: roles, usuarios y ruta del driver",
    "highlights": [
      "Se reforzaron rutas por rol: admin entra a /admin y driver a /app con bloqueos automáticos.",
      "Se creó panel Admin Usuarios para listar perfiles y cambiar roles de forma segura.",
      "El cambio de rol ahora pasa por un endpoint backend protegido con validación de admin.",
      "Se añadieron tablas de rutas y paradas para drivers con reglas de acceso por rol.",
      "Inicio de driver ahora muestra ‘Mi ruta de hoy’ con paradas ordenadas y estado actual.",
      "Se corrigió importación/parseo de status para evitar fallos de build por tipos.",
      "Se corrigió la sintaxis JSX en login para evitar fallo de build por tags desbalanceados.",
      "Se corrigió /admin/users para listar perfiles vía endpoint backend admin y mostrar errores reales.",
      "Se hizo /admin/users client-side con token del navegador para funcionar mejor en Deploy Preview."
    ]
  },
  {
    "date": "2026-02-05",
    "title": "Fix Netlify prerender en /auth/callback",
    "highlights": [
      "Se refactorizó /auth/callback a página server con Suspense para cumplir Next.js build.",
      "Se movió useSearchParams/useRouter a CallbackClient.tsx con use client.",
      "Se agregó dynamic = force-dynamic para evitar prerender estático en callback.",
      "Se mantuvo exchangeCodeForSession(code) y redirección final a /app tras procesar sesión."
    ]
  },
  {
    "date": "2026-02-05",
    "title": "Fix callback de Supabase + RLS sin recursión",
    "highlights": [
      "Se agregó /auth/callback para procesar retorno de confirmación y recuperación de contraseña.",
      "Signup y reset password ahora usan redirect URLs basadas en window.location.origin para evitar localhost incorrecto.",
      "Se corrigieron policies de profiles para eliminar la recursión infinita con una función SECURITY DEFINER is_admin().",
      "Se reforzó que el cliente no pueda cambiar role con permisos de update limitados a email/full_name.",
      "Se mantuvo el resumen de actualización en login con historial actualizado."
    ]
  },
  {
    "date": "2026-02-05",
    "title": "Fix crítico de signup en Supabase",
    "highlights": [
      "Se auditó la configuración de NEXT_PUBLIC_SUPABASE_URL y NEXT_PUBLIC_SUPABASE_ANON_KEY.",
      "Se agregó health-check visible en login (solo dev) con project-ref y estado de conexión.",
      "Se corrigió el flujo de signUp para no fallar cuando hay confirmación por correo o perfil aún no sincronizado.",
      "Se mejoraron mensajes de error de auth: Invalid API key, Email rate limit, User already registered y Email not confirmed.",
      "Se agregaron logs de depuración en dev con URL de Supabase y endpoint esperado /auth/v1/signup."
    ]
  },
  {
    "date": "2026-02-05",
    "title": "Roles y perfiles en Supabase",
    "highlights": [
      "Se creó el enum user_role con admin, driver y ops en la base de datos.",
      "Se agregó la tabla profiles y un trigger automático al registrar usuarios en auth.users.",
      "Se activó RLS en profiles con políticas para perfil propio y lectura global para admin.",
      "El login ahora carga el rol desde Supabase y protege mejor el acceso a /admin.",
      "Se añadió un endpoint seguro para actualizar roles usando service role solo en backend."
    ]
  },
  {
    "date": "2026-02-05",
    "title": "Bloque 3: Auth y seguridad",
    "highlights": [
      "Se habilitó registro de usuarios (signup) con sesión automática.",
      "Se agregaron rutas protegidas y redirección inteligente para usuarios autenticados.",
      "Se implementó flujo de recuperación de contraseña con validaciones y mensajes claros.",
      "Se mejoró el cierre de sesión con redirección y toast de confirmación.",
      "Se añadió un resumen de actualización con historial en modal dentro del login."
    ]
  },
  {
    "date": "2025-02-04",
    "title": "Mejoras de login",
    "highlights": [
      "Se agregó un resumen visual de cambios en la pantalla de acceso.",
      "Se mejoró la sección de demo rápida para QA.",
      "Se pulieron mensajes de estado durante la carga."
    ]
  }
]
